# 함수
# 변수 : 데이터값을 저장하기 위한 공간 (값 재사용/수정 목적)
# 함수 : 코드를 저장하기 위한 공간 (코드 재활용 목적)

#변수를 생성

이름 = '홍길동'                              #변수는 데이터만 저장 가능  


# 함수를 생성
def 홍길동():                                #함수는 코드를 저장 (print 같은 것 사용 가능) 
    print('안녕하세요 저는 홍길동 입니다')
    print('제가 사는 곳은 인천이고요')
    print('oo대학교에 다니고 있습니다')

def 임꺽정():
    print('안녕하세요 저는 임꺽정 입니다')
    print('제가 사는 곳은 서울이고요')
    print('aa대학교에 다니고 있습니다')

def 유관순():
    print('안녕하세요 저는 유관순 입니다')
    print('제가 사는 곳은 부천이고요')
    print('bb대학교에 다니고 있습니다') 

# 변수 사용
print(이름)

# 함수 사용
홍길동()
홍길동()
임꺽정()

